using UnityEngine;

public class LevelLogickManager : MonoBehaviour
{
    //Камера переносится к капитану -> Сверху написаны задачи + геймплей (Q отключено) ->
    //Через время новый персонаж (анимация, новая надпись, камера летает по объектам и пишется как починить)
    //И тд

    //Капитан - можно начать спавнить ледники
    //Механик - сломать штурвал и мачту по-очереди
    //Пушкарь - Враги
    //Доктор - болезнь 
    //Потом начинается таймер и полноценная игра

    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
